---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.DuplicateTypeName
source: html/f3d35771-84a4-c670-ccf1-df79575d864b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.DuplicateTypeName Property

"Ignoring attempt to add family type '%1!s!' for a second time."

## Syntax (C#)
```csharp
public static FailureDefinitionId DuplicateTypeName { get; }
```